Revit 2024 API
ElectricalSetting.DistributionSysTypes Property
 Get all distribution system types of the project.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public DistributionSysTypeSet DistributionSysTypes { get; }
Visual Basic
Public ReadOnly Property DistributionSysTypes As DistributionSysTypeSet
	Get
Visual C++
public:
property DistributionSysTypeSet^ DistributionSysTypes {
	DistributionSysTypeSet^ get ();
}
See Also
ElectricalSetting Class
Autodesk.Revit.DB.Electrical Namespace